IdeaRS.OpenModel.Connection.ConnectionData
Provides data of the connection

IdeaRS.OpenModel.Connection.ConnectionData.Beams
Connected beams

IdeaRS.OpenModel.Connection.ConnectionData.Plates
Plates of the connection

IdeaRS.OpenModel.Connection.ConnectionData.BoltGrids
Bolt grids which belongs to the connection

IdeaRS.OpenModel.Connection.ConnectionData.Welds
Welds of the connection